cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/fuse'
tap 'homebrew/php'
tap 'getantibody/homebrew-antibody'

# install mac appstore apps
brew 'mas'

# libcaca depends on this!
cask 'xquartz'

# bindfs depends on this!
cask 'osxfuse'

# shells
brew 'bash'
brew 'zsh'

brew 'antibody'
brew 'ack'
brew 'bindfs'
brew 'coreutils'
brew 'go'
brew 'gnupg2'
brew 'grc'
brew 'git', args: ['without-completions']
brew 'git-extras'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'mariadb'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'roundup'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'watchman'
brew 'yarn'
brew 'youtube-dl'
brew 'ansible'

# PHP things
brew 'php70'
brew 'wp-cli'
brew 'composer'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'slack'
cask 'google-chrome'
cask 'sourcetree'
cask 'steam'
cask 'sequel-pro'
cask 'mplayerx'
cask 'kitematic'
cask 'jdownloader'
cask 'franz'
cask 'google-drive'
cask 'cyberduck'
cask 'java'
cask 'vlc'
cask 'vagrant'
cask 'virtualbox'

# Fonts
cask 'font-awesome-terminal-fonts'
cask 'font-fira-code'

mas 'Pages', id: 409201541
mas 'Numbers', id:409203825
