cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/php'
tap 'homebrew/command-not-found'

#install mac appstore apps
brew 'mas'

#libcaca depends on this!
cask 'xquartz'

brew 'bash'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'git'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'roundup'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

# PHP things
brew 'php70'
brew 'wp-cli'
brew 'composer'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'firefox'
cask 'slack'
cask 'google-chrome'
cask 'openpht'
cask 'sourcetree'
cask 'java'
cask 'vlc'

mas 'Pages', id: 409201541
mas 'Numbers', id:409203825
